#include <iostream>
using namespace std;

const int MAX_SIZE = 100;

int main() {
    int matrix[MAX_SIZE][MAX_SIZE];
    int n; // Розмірність матриці

    cout << "Введіть розмірність квадратної матриці: ";
    cin >> n;

    cout << "Введіть елементи матриці:\n";

    // Зчитуємо елементи матриці
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            cin >> matrix[i][j];
        }
    }

    cout << "Суми елементів на головній діагоналі з відповідними рядками та стовпцями:\n";

    // Обчислюємо суми та виводимо їх
    for (int i = 0; i < n; ++i) {
        int sum = 0;

        // Обчислюємо суму для кожного елемента на головній діагоналі
        for (int j = 0; j < n; ++j) {
            if (j != i) { // Якщо елемент не знаходиться на головній діагоналі
                sum += matrix[i][j]; // Додаємо до суми
            }
        }

        cout << "Сума елементів рядка " << i + 1 << " з відповідним стовпцем на головній діагоналі: " << sum << endl;
    }

    return 0;
}
